# Напишите программу, удаляющую из текста все слова, содержащие ""абв"".

print(" ".join(input("Введите слово ").replace("абв", "").split()))
