# Напишите программу, удаляющую из текста все слова, содержащие ""абв"".


some_string = input("Введите слово ").replace("абв", "")
print(some_string)
